data/openfoam_sample_a/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.;
    }
    outlet
    {
           type            nutkWallFunction;
        value           uniform 0.;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.
        value           uniform 0.;
    }
  
    "cylinder.*"
    {
        type            nutkWallFunction;
        value           uniform 0.;
    }
   
 lateral
    {
        type            inletOutlet;
        inletValue      uniform 0.
        value           uniform 0.;
    }
    front
     {
        type            symmetryPlane;
        
    }
    back
     {
        type            symmetryPlane;
        
    }

}


// ************************************************************************* //
