data/openfoam_sample_a/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
          type            omegaWallFunction;
        value           uniform 0.1470;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
  
    "cylinder.*"
    {
        type            omegaWallFunction;
        value           uniform 0.1470;
    }
     lateral
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    front
     {
        type            symmetryPlane;
        
    }
    back
     {
        type            symmetryPlane;
        
    }
}



// ************************************************************************* //
