data/openfoam_sample_a/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    outlet
       {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    atmosphere
    {
       type            totalPressure;
        p0              uniform 0;
    }
   
    "cylinder.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

 
 lateral
       {
       type            prghPressure;
	rho          rho;
        value           uniform 0;
        p uniform 0;
  
    }
    front
     {
        type            symmetryPlane;
        
    }
    back
     {
        type            symmetryPlane;
        
    }


    
}

// ************************************************************************* //
