data/openfoam_sample_a/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

toto
{
    alpha           alpha.water;

    waveModel       StokesI;

    nPaddle         1;

    waveHeight      0.05;

    waveAngle       0.0;

    rampTime        3.0;

    activeAbsorption yes;

    wavePeriod      3.0;
}

lateral
{
    alpha           alpha.water;

    waveModel       shallowWaterAbsorption;

    nPaddle         1;
    waterDepth 1.5;
}


// ************************************************************************* //
