data/openfoam_sample_a/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
   /* (-0.4   0.001 0    )//0
    ( 0.0   0.001 0    )//1
    ( 0.0   0.001 0.2 )//2
    ( 0.0   0.001 0.9 )//3    face avant
    (-0.4   0.001 0.9 )//4
    (-0.4   0.001 0.2 )//5
    (-0.4   0.0   0    )//6  debut face arrière
    ( 0.0   0.0   0    )//7
    ( 0.0   0.0   0.2 )//8
    ( 0.0   0.0   0.9 )//9    
    (-0.4   0.0   0.9 )//10
    (-0.4   0.0   0.2 )//11
    ( 3.0   0.0   0.0 )//12
    ( 3.0   0.0   0.2 )//13  
    ( 3.0   0.001   0.0 )//14
    ( 3.0   0.001   0.2 )//15
    //( 3.0   0.001   0.2 )//16
    //( 3.0   0.001   0.2 )//17
    //( 3.0   0.001   0.2 )//18
    //( 3.0   0.001   0.2 )//19
    
    */
    (0   0     0.00    )//0
    (0.3 0     0.00    )//1
    (0.3 0.3 0.00    )//2
    (0   0.3 0.00    )//3    face avant
    (0   0     1.65 )//4
    (0.3 0     1.65 )//5
    (0.3 0.3 1.65 )//6
    (0   0.3 1.65 )//7    face avant
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 110) simpleGrading (1 1 1) // 0.008
    //hex (5 2 3 4 11 8 9 10) (40 70 1) simpleGrading (1 1 1)// block du haut
    //hex (1 14 15 2 7 12 13 8) (300 20 1) simpleGrading (1 1 1)// block de droite
  //  hex (5 2 16 17 8 11 18 19) (20 20 1) simpleGrading (1 1 1) // block du bas maillage carre 10x10mm
);

edges
(
);

boundary
(

    
    lateral
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (1 2 6 5)
            (0 3 7 4)
            
            
            
            
        );
    }
    
   
     outlet
    {
        type patch;
        faces
        (
           (0 1 2 3)
        );
    }
    defaultFaces
    {
    type wall;
    faces
        (
         
        );
        }
        
        atmosphere
        {
        type patch;
        faces
        (
           (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
