data/openfoam_sample_a/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0.000;

stopAt          endTime;

endTime         2.0;

deltaT          0.00025;

writeControl    adjustableRunTime;

writeInterval   0.1; //fréquence à laquelle sort une solution pour qu'elle soit lue//0.05

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.35;
maxAlphaCo      0.35;

maxDeltaT       1;


libs (
      "libgroovyBC.so"
      "libgroovyStandardBCs.so"
     
     );
// ************************************************************************* //
