data/openfoam_sample_a/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
     //   volScalarFieldValue p_rgh 0
);

regions
(
    boxToCell
    {
        box (-1.5 -0.5 0) (1.0 1.0 1.5);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        //    volScalarFieldValue p_rgh 14715
        );
    }/*
boxToCell
    {
        box (2.9 0.0 0) (7.0 3.3 0.16);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }*/

);


// ************************************************************************* //
