data/openfoam_sample_a/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // BCWALL_FLOWSLEEVE_EXT
    /*{
        name    inletFaceSet;           //name of the new set to be created
        type    faceSet;                  // is it a cellSet or faceSet?
        action  new;                        // is it new or appending?
        source  boxToFace;             // extracting faces from the defined box 
        sourceInfo                          // box details 
        {
             box  (0.1 0.1 1.5) (0.2 0.2 1.6);  //Fine adjustments are need to extract faces alone from desired face. Tip: Load the surface in paraview, and get the x-bounds correctly. 
        }
    }*/
    {
     name    facePatch1;
     type    faceSet;
     action  new;
     source  patchToFace;
        patches
        (
            cylinder
        );
     }  
      
     {
        name    facePatch1;
        type    faceSet;
        action  subtract;
        source  normalToFace;
        normal  (0 0 1);
        cos 0.01;
        }
        {
     name    inletFaceSet;
     type    faceSet;
     action  new;
     source  patchToFace;
        patches
        (
            cylinder
        );
     } 
       {
     name    inletFaceSet;
     type    faceSet;
     action  new;
     source  patchToFace;
        patches
        (
            cylinder
        );
     } 
    {
        name    inletFaceSet;
        type    faceSet;
        action  subtract;
        source  faceToFace;
       
        set facePatch1;
    }
    

    

);
